app/views/eventos/index.html.erb

                  <p><%= evento.endereco %></p>
                  <p>Vagas disponíveis: <%= evento.vagasdisponiveis  -  evento.inscricoes.count() %></p>
---
SELECT COUNT(*) FROM "inscricoes" WHERE "inscricoes"."evento_id" = ?  [["evento_id", 2]]