app/views/eventos/show.html.erb

SELECT COUNT(*) FROM "inscricoes" WHERE "inscricoes"."evento_id" = ?  [["evento_id", 2]]
---
  <strong>Vagasdisponiveis:</strong>
  <%= @evento.vagasdisponiveis  -  @evento.inscricoes.count() %>

SELECT  "inscricoes".* FROM "inscricoes" WHERE "inscricoes"."usuario_id" = ? AND "inscricoes"."evento_id" = ?  ORDER BY "inscricoes"."id" ASC LIMIT 1  [["usuario_id", 8], ["evento_id", 2]]
SELECT COUNT(*) FROM "inscricoes" WHERE "inscricoes"."usuario_id" = ? AND "inscricoes"."evento_id" = ?  [["usuario_id", 8], ["evento_id", 2]]
---

<% if usuario_signed_in? && (current_usuario.inscricoes.where(evento_id:@evento.id).count) > 0 %>