app/views/inscricoes/index.html.erb

                        <p><%= inscricao.evento.endereco %></p>
                        <p>Vagas disponíveis: <%= inscricao.evento.vagasdisponiveis  -  inscricao.evento.inscricoes.count() %></p>
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "inscricoes" WHERE "inscricoes"."evento_id" = ?  [["evento_id", 2]]