app/controllers/avaliacoes_controller.rb

SELECT "avaliacoes".* FROM "avaliacoes" WHERE "avaliacoes"."usuario_id" = ?  [["usuario_id", 7]]
---
	def index
	 	@avaliacoes = current_usuario.avaliacoes.all

INSERT INTO "avaliacoes" ("evento_id", "nota", "texto", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
  		#@avaliacao = Avaliacao.new(avaliacao_params)
  		@avaliacao = current_usuario.avaliacoes.build(avaliacao_params)

  		if @avaliacao.save