app/controllers/eventos_controller.rb

SELECT "eventos".* FROM "eventos"
---
  def index
    @eventos = Evento.all

SELECT  "avaliacoes".* FROM "avaliacoes" WHERE "avaliacoes"."usuario_id" = ? AND "avaliacoes"."evento_id" = ?  ORDER BY "avaliacoes"."id" ASC LIMIT 1  [["usuario_id", 7], ["evento_id", 2]]
---
  def show
    if (!current_usuario.blank?)
      @avaliacao =  current_usuario.avaliacoes.where(evento_id:@evento.id).first

INSERT INTO "eventos" ("nome", "descricao", "local", "endereco", "site", "vagasdisponiveis", "datainicio", "datafim", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

UPDATE "eventos" SET "palestrante" = ?, "imagem" = ?, "updated_at" = ? WHERE "eventos"."id" = ?  [["palestrante", "Silvio Guerra"], ["imagem", "2-PetroleoEGas.jpg"], ["updated_at", "2016-05-18 01:07:41.886981"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @evento.update(evento_params)

SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_evento
      @evento = Evento.find(params[:id])