app/controllers/inscricoes_controller.rb

	 def index
	 	@inscricoes = current_usuario.inscricoes.all
---
SELECT "inscricoes".* FROM "inscricoes" WHERE "inscricoes"."usuario_id" = ?  [["usuario_id", 8]]

	def create
  		#@inscricao = Inscricao.new(inscricao_params)
  		@inscricao = current_usuario.inscricoes.build(inscricao_params)

  		if @inscricao.save
---
INSERT INTO "inscricoes" ("evento_id", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["evento_id", 2], ["usuario_id", 8], ["created_at", "2016-05-06 19:59:48.871129"], ["updated_at", "2016-05-06 19:59:48.871129"]]

    def set_evento
      @evento = Evento.find(params[:evento_id])
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", 2]]